[{"ball":"15.6","score":"4","commentary":"Wahab Riaz to Ingram, FOUR, backs away and slaps this short delivery to the wide long-off fence, but it doesn't matter.  Sammy roars, Zalmi fans roar.  Karachi had two shots at the final and they've failed in both.  PSL 2016 champs v PSL 2017 champs to contest the grand finale in 2018 "},{"ball":"15.5","score":"1","commentary":"Wahab Riaz to Denly, 1 run, pulls this short ball on middle to deep square.  Game over.  Karachi's hopes extinguished."},{"ball":"15.4","score":"4","commentary":"Wahab Riaz to Denly, FOUR, slapped over cover, good strike, clean strike. But this won't do."},{"ball":"15.3","score":"0","commentary":"Wahab\n Riaz to Denly, no run, swing and a miss. Have they nipped this in the \nbud? Slower bouncer on middle, played too early in trying to pull"},{"ball":"15.2","score":"2","commentary":"Wahab\n Riaz to Denly, 2 runs, he's sliced this over the infield, bounces away \ntowards the point boundary. Deep cover comes around to cut that off. \nWanted to hit over long-off but didn't get power on that slower onr"},{"ball":"15.1","score":"1","commentary":"Wahab Riaz to Ingram, 1 run, drags this from outside off towards long-on, lovely slower delivery"},{"ball":"15.1","score":"1nb","commentary":"Wahab Riaz to Ingram, 1(no ball) , high full toss that hits him on the stomach. Missed this swing.  No-ball, so a free-hit  Some drama. Can he cash in?"},{"ball":"14.6","score":"4","commentary":"Hasan Ali to Denly, FOUR,\n helped to the fine leg fence. Slower and fuller down leg, looked to \nswing over square leg but this flew off a thick inside edge past short \nfine"},{"ball":"14.5","score":"4","commentary":"Hasan Ali to Denly, FOUR, beats mid-off. Too full, he backed away and hammered it away off the middle of the bat."},{"ball":"14.4","score":"6","commentary":"Hasan Ali to Denly, SIX,\n clean strike down the ground to beat long-on, who was running around \nthe ropes to get there. This was slower and fuller, he backed away and \nbelted this superbly."},{"ball":"14.3","score":"W","commentary":"Hasan Ali to Babar Azam, OUT,\n hoicked straight to deep midwicket. Surely Karachi fans won't be \ndisappointed with that? Hasan Ali will take that into his kitty. Looked \nto clear his front leg and swing over the ropes, no timing."},{"ball":"14.2","score":"1","commentary":"Hasan Ali to Denly, 1 run, sits up nicely on middle, he pulls but can't get much power behind that. Down to deep midwicket"},{"ball":"14.1","score":"1","commentary":"Hasan\n Ali to Babar Azam, 1 run, backs away to go over cover, but ends up \ngetting a thick inside edge onto his pad off the knuckle ball"},{"ball":"13.6","score":"1","commentary":"Jordan to Babar Azam, 1 run, no control of this big hit, sliced towards deep cover."},{"ball":"13.5","score":"0","commentary":"Jordan to Babar Azam, no run, superb yorker, jams his bat down in time to keep that out."},{"ball":"13.4","score":"4","commentary":"Jordan to Babar Azam, FOUR,\n hammered, deep cover wasn't more than 10 metres away but he couldn't \nget there. Jordan went for a yorker but missed his mark by very little. \nIs there life in the game yet?"},{"ball":"13.3","score":"1","commentary":"Jordan to Denly, 1 run, goes over the infield, on the bounce to sweeper cover"},{"ball":"13.2","score":"0","commentary":"Jordan to Denly, no run, full, straight and outside off. Denly is beaten as he looks to slap this over cover."},{"ball":"13.1","score":"1","commentary":"Jordan to Babar Azam, 1 run, full toss outside off, carved away to deep point"},{"ball":"12.6","score":"4","commentary":"Hasan Ali to Denly, FOUR, backs away and drills this full delivery to the extra cover fence. Went for the yorker, missed his length by an inch."},{"ball":"12.5","score":"1","commentary":"Hasan Ali to Babar Azam, 1 run, no control over this attempted slap back past the bowler, Hasan Ali gets his finger tips as he puts his left hand out. Took pace off"},{"ball":"12.4","score":"1","commentary":"Hasan Ali to Denly, 1 run, one-handed flat-batted pull towards deep midwicket."},{"ball":"12.3","score":"1","commentary":"Hasan Ali to Babar Azam, 1 run, slower length ball on middle, dragged towards deep square"},{"ball":"12.2","score":"4","commentary":"Hasan Ali to Babar Azam, FOUR, full toss again, this time he belts this to beat extra cover's dive. Class written all over that"},{"ball":"12.1","score":"0","commentary":"Hasan Ali to Babar Azam, no run, backs away and mistimes this low full toss to extra cover"},{"ball":"11.6","score":"6","commentary":"Umaid Asif to Denly, SIX,\n magnificent strike. Down the pitch, clean swing of the arms to send \nthis length ball soaring towards the sightscreen. Denly's turn to raise \nthe bat as he too brings up a half-century"},{"ball":"11.5","score":"1","commentary":"Umaid\n Asif to Babar Azam, 1 run, drills this square drive to point and \nscampers a quick single to bring up his half-century. Applause from the \ndressing room but a sheepish acknowledgment from Babar. He knows there's\n a long, long way to go"},{"ball":"11.4","score":"1","commentary":"Umaid Asif to Denly, 1 run, mistimes a pull towards deep midwicket, backed away and was cramped for room"},{"ball":"11.3","score":"1","commentary":"Umaid Asif to Babar Azam, 1 run, steers this straight to point and scampers across for a quick single.  Run out chance missed at the bowler's end  not Zalmi won't mind."},{"ball":"11.2","score":"1","commentary":"Umaid Asif to Denly, 1 run, full and straight on the stumps, squeezed to long-on"},{"ball":"11.1","score":"1","commentary":"Umaid Asif to Babar Azam, 1 run, length on middle and leg, whipped to deep square"},{"ball":"10.6","score":"1","commentary":"Wahab Riaz to Babar Azam, 1 run, makes room and glides this short of length delivery to third man"},{"ball":"10.5","score":"1","commentary":"Wahab Riaz to Denly, 1 run, short ball outside off, worked across the line to deep square leg."},{"ball":"10.4","score":"4","commentary":"Wahab Riaz to Denly, FOUR,\n belted down the ground, beats mid-off. Wahab goes full but misses the \nyorker. They're now getting a move-on but is it coming a little too \nlate?"},{"ball":"10.3","score":"4","commentary":"Wahab Riaz to Denly, FOUR, looks to swing this over long-on but gets a thick outside edge that bounces away past the diving third man fielder. Lucky runs"},{"ball":"10.2","score":"1","commentary":"Wahab Riaz to Babar Azam, 1 run, length outside off, steers this to point, excellent stop"},{"ball":"10.1","score":"6","commentary":"Wahab Riaz to Babar Azam, SIX,\n this is high, really really high but way over the sightscreen. Backed \naway, got underneath this full delivery and teed off in style."},{"ball":"9.6","score":"1","commentary":"Umaid Asif to Babar Azam, 1 run, steered to deep point, used the pace nicely."},{"ball":"9.5","score":"1","commentary":"Umaid Asif to Denly, 1 run, steps out and swings this length ball down to long-on, can't pick the gap again."},{"ball":"9.4","score":"1","commentary":"Umaid Asif to Babar Azam, 1 run, pulled but not in control, on the bounce to deep midwicket"},{"ball":"9.3","score":"1lb","commentary":"Umaid\n Asif to Denly, 1 leg bye, looking to hit this too hard, tries to whip \nthis over midwicket but misses. Ball deflects off the pad to the off \nside as they take a leg bye"},{"ball":"9.3","score":"1w","commentary":"Umaid Asif to Denly, 1 wide, looks to whip this fine but can't lay bat on this short ball angling in."},{"ball":"9.2","score":"0","commentary":"Umaid\n Asif to Denly, no run, slower bouncer but well outside off, he takes a \nstep out to swing but played too early again. On the bounce to the \nkeeper"},{"ball":"9.1","score":"0","commentary":"Umaid Asif to Denly, no run, steps out to pull but is beaten by a slower delivery"},{"ball":"8.6","score":"2","commentary":"Jordan to Babar Azam, 2 runs, converts this yorker-length into a low full toss on the pads, worked to deep square leg"},{"ball":"8.5","score":"2","commentary":"Jordan\n to Babar Azam, 2 runs, excellent yorker on the base of leg stump, \nsqueezed towards the man coming in from deep midwicket. Superb running"},{"ball":"8.4","score":"1","commentary":"Jordan to Denly, 1 run, backs away to carve this over point, gets a thick outside edge on the bounce to third man"},{"ball":"8.3","score":"2","commentary":"Jordan to Denly, 2 runs, full toss outside off, he belts this into the gap at deep extra cover"},{"ball":"8.2","score":"1","commentary":"Jordan to Babar Azam, 1 run, full and slanting into middle, drilled down to long-on"},{"ball":"8.1","score":"0","commentary":"Jordan to Babar Azam, no run, drills this full delivery to the edge of the ring at cover"},{"ball":"7.6","score":"1","commentary":"Umaid Asif to Babar Azam, 1 run, plays the short-arm jab towards deep square leg"},{"ball":"7.5","score":"4","commentary":"Umaid Asif to Babar Azam, FOUR, thick outside edge that beats third man. Looked to slash this over point, genuine edge but he'll take the runs"},{"ball":"7.4","score":"0","commentary":"Umaid Asif to Babar Azam, no run, back of length outside off, steered straight to point"},{"ball":"7.3","score":"2","commentary":"Umaid Asif to Babar Azam, 2 runs, full and straight on off, belted over the bowler's head, long-on comes around to cut that off"},{"ball":"7.2","score":"4","commentary":"Umaid Asif to Babar Azam, FOUR,\n backs away to leg stump and then angles his bat to nudge this wide of \nthe keeper to the third man boundary. Kamran may have been influenced by\n Babar's shimmie towards leg."},{"ball":"7.1","score":"1","commentary":"Umaid Asif to Denly, 1 run, steers this down to square third man for an easy single"},{"ball":"6.6","score":"0","commentary":"Wahab Riaz to Babar Azam, no run, sways out of the way of this short ball outside off"},{"ball":"6.5","score":"1","commentary":"Wahab Riaz to Denly, 1 run, off the thigh pad as it deflects to the off side, they scamper a leg bye"},{"ball":"6.4","score":"0","commentary":"Wahab Riaz to Denly, no run, hustled for pace, threw him off balance as he tried to work this square on the leg side. Denly nearly slipped onto the stumps.  This hit him so close to the box. Ouch"},{"ball":"6.3","score":"0","commentary":"Wahab Riaz to Denly, no run, play and a miss. Touch fuller and slanting away again, looked to steer this behind point"},{"ball":"6.2","score":"1","commentary":"Wahab Riaz to Babar Azam, 1 run, chops this down to third man, did well to get on top of the bounce"},{"ball":"6.1","score":"4","commentary":"Wahab Riaz to Babar Azam, FOUR, steered off the face of the bat, beats square third man. Used Wahab's pace to good effect. Nicely done"},{"ball":"5.6","score":"6","commentary":"Sameen Gul to Denly, SIX,\n hoicked and this sails over midwicket. Lovely hit, made sweet sound as \nit made connection with this full delivery. Didn't matter that he \ndragged it from outside off."},{"ball":"5.5","score":"1","commentary":"Sameen Gul to Babar Azam, 1 run, plays the short-arm jab towards deep midwicket"},{"ball":"5.4","score":"1","commentary":"Sameen Gul to Denly, 1 run, length on off stump, chopped down to third man"},{"ball":"5.3","score":"4b","commentary":"Sameen\n Gul to Denly, 4 byes, big swing, big miss from both the batsman and \nkeeper. This was angling in from wide of the crease, dying on Akmal as \nhe tried to move low to his left. Should've grabbed that"},{"ball":"5.2","score":"1","commentary":"Sameen Gul to Babar Azam, 1 run, length on off stump, steers this down to third man"},{"ball":"5.1","score":"1lb","commentary":"Sameen\n Gul to Denly, 1 leg bye, big, big appeal for lbw as Denly is stuck on \nthe pad as he looks to play across the line. They scamper a leg bye. \nReplays suggest this may have just missed leg stump."},{"ball":"4.6","score":"0","commentary":"Jordan to Babar Azam, no run, yorker-length outside off, angles in late, Babar beaten as he plays outside the line of this."},{"ball":"4.5","score":"4","commentary":"Jordan to Babar Azam, FOUR, slower and fuller outside off - a bit too predictable, really. Babar holds his shape and slaps this to the point boundary"},{"ball":"4.4","score":"6","commentary":"Jordan to Babar Azam, SIX,\n manages to swing this deep into the deep square leg boundary. This was a\n slower length ball angling in and he just helped this along. Got more \nelevation but the timing wasn't half as bad as it looked."},{"ball":"4.3","score":"1","commentary":"Jordan to Denly, 1 run, slower and fuller on off stump, dabbed towards point"},{"ball":"4.2","score":"1","commentary":"Jordan to Babar Azam, 1 run, works this down towards deep square as they jog the single"},{"ball":"4.1","score":"0","commentary":"Jordan to Babar Azam, no run, stands tall and punches this short of length delivery to cover"},{"ball":"3.6","score":"0","commentary":"Sameen Gul to Denly, no run, steps out and looks to flat-bat this over the bowler's head, misses."},{"ball":"3.5","score":"0","commentary":"Sameen Gul to Denly, no run,  dropped by Gul off his own bowling \n but a magnificent effort. This length ball stopped on Denly, who chips \nit back. Gul did all the hard work in running to his right and diving \nfull stretch to his right on the followthrough but just couldn't hold \non."},{"ball":"3.4","score":"0","commentary":"Sameen\n Gul to Denly, no run, looks to swing this towards the leg side but Gul \ncleverly shortens his length and cramps him for room. Beaten"},{"ball":"3.3","score":"6","commentary":"Sameen Gul to Denly, SIX,\n clean strike. Magnificent strike. Sashays down the pitch, makes some \nroom and goes over cover. Sailed over the ropes. Would've cleared any \nboundary in the world."},{"ball":"3.3","score":"1w","commentary":"Sameen\n Gul to Denly, 1 wide, banged in short but this is way over the \nbatsman's head. Kamran had to use every bit of his leap to stop that"},{"ball":"3.2","score":"0","commentary":"Sameen\n Gul to Denly, no run, looks to hoick this across the line but this \nlength ball angles in from wide of the crease and hits him on the body."},{"ball":"3.1","score":"1","commentary":"Sameen Gul to Babar Azam, 1 run, whips this length ball towards mid-on where Wahab comes up with a tumbling stop"},{"ball":"2.6","score":"1","commentary":"Hasan Ali to Babar Azam, 1 run, turns this short of length delivery on middle to square leg"},{"ball":"2.5","score":"0","commentary":"Hasan Ali to Babar Azam, no run, backs away and mistimes this attempted slap to point. Five dot balls, pressure building"},{"ball":"2.4","score":"0","commentary":"Hasan\n Ali to Babar Azam, no run, looks to force this on the up but is beaten \nby the pace and carry. Kamran takes it above his shoulders. Outstanding \nbowling"},{"ball":"2.3","score":"0","commentary":"Hasan Ali to Babar Azam, no run, has a poke but is beaten by the late movement again."},{"ball":"2.2","score":"0","commentary":"Hasan\n Ali to Babar Azam, no run, zips away from length outside off, Babar \nplays inside the line as this whizzes through to Kamran Akmal"},{"ball":"2.1","score":"0","commentary":"Hasan Ali to Babar Azam, no run, driven firmly but can't pierce the packed off side ring, straight to cover point"},{"ball":"1.6","score":"2","commentary":"Sameen Gul to Denly, 2 runs, whipped uppishly towards Dawson at deep square leg"},{"ball":"1.5","score":"0","commentary":"Sameen Gul to Denly, no run, steps out, backs away to swing to the leg side but is cramped for room, beaten again."},{"ball":"1.4","score":"0","commentary":"Sameen Gul to Denly, no run, squared up by a beauty.... almost snaffled by Sammy at slip!  Very quickly signalled that he took that on the bounce. Lovely delivery, late movement off the seam from middle"},{"ball":"1.3","score":"1","commentary":"Sameen Gul to Babar Azam, 1 run, angled into middle and leg, turned to the leg side"},{"ball":"1.2","score":"W","commentary":"Sameen Gul to Mukhtar Ahmed, OUT,\n thick outside edge and this is a sensational catch by Sammy at first \nslip. Mukhtar's first outing in PSL is a very brief one. He looked to \nhoick this across the line but only managed a thick edge that flew, \nSammy was swift to move to his left and take a sharp catch at face \nheight."},{"ball":"1.1","score":"0","commentary":"Sameen Gul to Mukhtar Ahmed, no run, beaten as he looks to loft this length ball over mid-off. Gets some shape away off the seam"},{"ball":"0.6","score":"0","commentary":"Hasan Ali to Denly, no run, beaten as he looks to flay this length ball on the up. Zipped through to the keeper."},{"ball":"0.5","score":"4","commentary":"Hasan Ali to Denly, FOUR,\n floats this full delivery on the pads, Denly's balance and poise is \nimmaculate as he flicks this to the midwicket boundary. Delightful wrist\n work"},{"ball":"0.4","score":"0","commentary":"Hasan Ali to Denly, no run, a half-hearted poke and a miss to a length ball that shapes away from off stump."},{"ball":"0.3","score":"4","commentary":"Hasan Ali to Denly, FOUR, uppish but over Sammy's head at wide first slip.  Not in control of that at all.  Pushed hard at this delivery away from the body. Lucky to get away with that"},{"ball":"0.2","score":"4","commentary":"Hasan Ali to Denly, FOUR, opened the bat face late to steer this nicely, beats square third man to the boundary."},{"ball":"0.1","score":"1","commentary":"Hasan Ali to Mukhtar Ahmed, 1 run, length ball that nips away a touch from outside off, steered to third man"}]